# Windows native applications — install via winget
# Usage: winget install --id <ID> --silent --accept-package-agreements --accept-source-agreements
# Or run setup.ps1 to install all at once.
#
# Philosophy: native GUI apps via winget, CLI/dev tools via Scoop.

# ─── Browser ──────────────────────────────────────────────────────────────────
TheBrowserCompany.Arc

# ─── Microsoft 365 (requires subscription — installs Word, Excel, Outlook, etc.)
Microsoft.Office

# ─── Productivity & Launchers ─────────────────────────────────────────────────
Obsidian.Obsidian
Microsoft.PowerToys
voidtools.Everything
Flow-Launcher.Flow-Launcher

# ─── Development ──────────────────────────────────────────────────────────────
Docker.DockerDesktop
Git.Git
SublimeHQ.SublimeText.4
Microsoft.VisualStudioCode
Microsoft.WindowsTerminal
Anysphere.Cursor

# ─── Security & Networking ────────────────────────────────────────────────────
AgileBits.1Password
Tailscale.Tailscale
AdGuard.AdGuard

# ─── Sync & Backup ───────────────────────────────────────────────────────────
Syncthing.Syncthing

# ─── Utilities ────────────────────────────────────────────────────────────────
ShareX.ShareX
7zip.7zip
REALiX.HWiNFO
Logitech.OptionsPlus

# ─── Communication ───────────────────────────────────────────────────────────
SlackTechnologies.Slack
Discord.Discord
Zoom.Zoom
Grammarly.Grammarly

# ─── Gaming ──────────────────────────────────────────────────────────────────
Valve.Steam
Mojang.MinecraftLauncher
EpicGames.EpicGamesLauncher

# ─── Media ───────────────────────────────────────────────────────────────────
VideoLAN.VLC
calibre.calibre
Audacity.Audacity

# --- Tools ---
Amazon.AWSCLI
HTTPie.HTTPie

# ─── Apple / iCloud ──────────────────────────────────────────────────────────
# iCloud for Windows (Microsoft Store version — preferred over legacy Apple.iCloud)
9PKTQ5699M62

# ─── Journaling ──────────────────────────────────────────────────────────────
# Day One (Microsoft Store — no proper winget ID)
9NN2H8X92WBT

# ─── AI ──────────────────────────────────────────────────────────────────────
Anthropic.Claude
Perplexity.Comet
# OpenAI ChatGPT — install from Microsoft Store: search "ChatGPT" in Store
