# Windows native applications — install via winget
# Usage: winget install --id <ID> --silent --accept-package-agreements --accept-source-agreements
# Or run setup.ps1 to install all at once.
#
# Philosophy: native GUI apps via winget, CLI/dev tools via Scoop.

# ─── Browser ──────────────────────────────────────────────────────────────────
TheBrowserCompany.Arc

# ─── Productivity & Launchers ─────────────────────────────────────────────────
Obsidian.Obsidian
Microsoft.PowerToys
voidtools.Everything
Flow-Launcher.Flow-Launcher

# ─── Development ──────────────────────────────────────────────────────────────
Git.Git
SublimeHQ.SublimeText.4
Microsoft.VisualStudioCode

# ─── Security & Networking ────────────────────────────────────────────────────
AgileBits.1Password
Tailscale.Tailscale
AdGuard.AdGuard

# ─── Sync & Backup ───────────────────────────────────────────────────────────
Syncthing.Syncthing

# ─── Utilities ────────────────────────────────────────────────────────────────
ShareX.ShareX
7zip.7zip
REALiX.HWiNFO
Logitech.OptionsPlus

# ─── Communication ───────────────────────────────────────────────────────────
SlackTechnologies.Slack
Zoom.Zoom
Grammarly.Grammarly

# ─── Gaming ──────────────────────────────────────────────────────────────────
Valve.Steam
EpicGames.EpicGamesLauncher

# ─── Media ───────────────────────────────────────────────────────────────────
VideoLAN.VLC
calibre.calibre
Audacity.Audacity

# ─── AI ──────────────────────────────────────────────────────────────────────
Anthropic.Claude
# OpenAI ChatGPT — install from Microsoft Store (not in winget repo)
