tap "lotyp/homebrew-formulae"

# ─── Homebrew Formulae ─────────────────────────────────────────────
# --- Shell & Navigation ---
brew "atuin"                # Sync and search shell history
brew "bat"                  # cat with syntax highlighting
brew "coreutils"            # GNU replacements for basic Unix tools
brew "eza"                  # Modern ls with icons and colors
brew "fd"                   # Fast file finder
brew "ripgrep"              # Fast text/code search
brew "fzf"                  # Fuzzy finder for interactive search
brew "yazi"                 # Terminal file manager with image preview
brew "tldr"                 # Simplified man pages with practical examples
brew "zoxide"               # Smarter cd command

# --- Testing ---
brew "bats-core"            # Bash Automated Testing System

# --- Development & Languages ---
brew "git"                  # Version control
brew "gh"                   # GitHub CLI
brew "1password-cli"        # 1Password CLI (op)
brew "git-delta"            # Syntax-highlighted diffs for Git
brew "lazygit"              # Terminal UI for git commands
brew "jq"                   # Parse and transform JSON data
brew "jless"                # Interactive JSON viewer
brew "python@3.13"          # Python 3.13 interpreter
brew "node"                 # Node.js runtime
brew "rust"                 # Rust programming language toolchain
brew "shellcheck"           # Linter for shell scripts
brew "stow"                 # Manage dotfiles with symlinks
brew "starship"             # Beautiful and minimal shell prompt
brew "tmux"                 # Terminal multiplexer (split panes/sessions)
brew "thefuck"              # Correct mistyped shell commands

# --- System & Automation ---
brew "dockutil"             # Manage macOS Dock items via CLI
brew "mas"                  # Mac App Store CLI for scripting installs
brew "wget"                 # Command-line downloader

# --- Media & Graphics ---
brew "chafa"                # Render images as ANSI art in the terminal
brew "ffmpeg"               # Video/audio conversion toolkit
brew "imagemagick"          # Image processing utilities
brew "webp"                 # Convert images to/from WebP format
brew "yt-dlp"               # Download videos from YouTube and many other sites

# --- Optional / Utility Tools ---
brew "awscli"               # AWS command-line interface
brew "croc"                 # Encrypted file transfer between devices
brew "duti"                 # Manage file type associations
brew "gnu-sed"              # GNU sed (more features than macOS sed)
brew "grip"                 # Render Markdown locally in a browser
brew "httpie"               # Human-friendly HTTP client
brew "kanata"               # Keyboard remapper daemon
brew "micro"                # Lightweight terminal text editor
brew "n"                    # Node.js version manager
brew "nmap"                 # Network mapper/scanner
brew "psgrep"               # Search running processes
brew "tree"                 # Display folder structures
brew "unar"                 # Extract archive files

# ─── Fonts (via Homebrew Cask) ────────────────────────────────────
cask "font-victor-mono-nerd-font"
cask "font-tinos-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-jetbrains-mono"
cask "font-roboto"
cask "font-open-sans"
cask "font-roboto-mono-nerd-font"
cask "font-ubuntu-nerd-font"
cask "font-noto-sans"
cask "font-terminess-ttf-nerd-font"
cask "font-opendyslexic-nerd-font"
cask "font-gohufont-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-monoid-nerd-font"
cask "font-inter"
cask "font-hurmit-nerd-font"
cask "font-lato"
cask "font-cabin"
