tap "armmbed/formulae"
tap "ethereum/ethereum"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "hybridgroup/tools"
tap "osx-cross/avr"
tap "px4/px4"
tap "socsieng/tap"
brew "autoconf"
brew "libusb-compat"
brew "avrdude"
brew "bsdiff"
brew "c-ares"
brew "libffi"
brew "python@3.9"
brew "cloc"
brew "cmake"
brew "pth"
brew "dirmngr"
brew "exiftool"
brew "jpeg"
brew "giflib"
brew "libtool"
brew "libevent"
brew "nettle"
brew "gnupg"
brew "gpg-agent"
brew "icu4c", link: true
brew "hexedit"
brew "libexif"
brew "libyaml"
brew "md5sha1sum"
brew "nmap"
brew "portaudio"
brew "postgresql"
brew "pygobject3"
brew "qt", link: false
brew "redis"
brew "sdl2"
brew "socat"
brew "swig"
brew "wget"
brew "zsh"
brew "armmbed/formulae/arm-none-eabi-gcc"
brew "osx-cross/avr/avr-gcc@9", link: false
brew "socsieng/tap/sendkeys"
cask "balenaetcher"
cask "calibre"
cask "hex-fiend"
cask "kap"
cask "osxfuse"
cask "qmk-toolbox"
cask "transmission"
cask "tunnelblick"
cask "vlc"
cask "wireshark"
cask "xquartz"
cask "yujitach-menumeters"
